In [2]:
import numpy as np
import pandas as pd

In [3]:
dict1={'Names':['Ramesh','Suresh',np.nan,'Mahesh'],
      'Age':[31,32,33,np.nan],
      'City':[np.nan,'Hyd','Mumbai','chennai']}

In [4]:
pd.DataFrame(dict1)

    Names   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2     NaN  33.0   Mumbai
3  Mahesh   NaN  chennai

In [5]:
data1=pd.DataFrame(dict1)

In [6]:
data1.isnull()

   Names    Age   City
0  False  False   True
1  False  False  False
2   True  False  False
3  False   True  False

In [7]:
data1.isnull().sum()
# every column has one missing values is there

Names    1
Age      1
City     1
dtype: int64

In [8]:
data1.isnull().sum()/len(data1)

Names    0.25
Age      0.25
City     0.25
dtype: float64

In [9]:
data1.isnull().sum()*100/len(data1)

Names    25.0
Age      25.0
City     25.0
dtype: float64

In [10]:
dict2={'Names':['Ramesh','Suresh',None,'Mahesh'],
      'Age':[31,32,33,None],
      'City':[None,'Hyd','Mumbai','chennai']}
data2=pd.DataFrame(dict2)
data2

    Names   Age     City
0  Ramesh  31.0     None
1  Suresh  32.0      Hyd
2    None  33.0   Mumbai
3  Mahesh   NaN  chennai

In [11]:
data2.isnull()

   Names    Age   City
0  False  False   True
1  False  False  False
2   True  False  False
3  False   True  False

In [12]:
data2.isnull().sum()

Names    1
Age      1
City     1
dtype: int64

In [13]:
dict3={'Names':['Ramesh','Suresh','Null','Mahesh'],
      'Age':[31,32,33,'Null'],
      'City':['Null','Hyd','Mumbai','chennai']}
data3=pd.DataFrame(dict3)
data3

    Names   Age     City
0  Ramesh    31     Null
1  Suresh    32      Hyd
2    Null    33   Mumbai
3  Mahesh  Null  chennai

**Method_1**

>Fill the missing values with random number

DataFrame name = data1
method name:filna

In [14]:
data1.fillna(40)

    Names   Age     City
0  Ramesh  31.0       40
1  Suresh  32.0      Hyd
2      40  33.0   Mumbai
3  Mahesh  40.0  chennai

In [15]:
Method_2

>Fill the missing values with random number
​
DataFrame name = data1
method name:filna

SyntaxError: invalid non-printable character U+200B (1970191084.py, line 4)

In [16]:
data1['Names'].fillna('Sathish',inplace=True)
data1

     Names   Age     City
0   Ramesh  31.0      NaN
1   Suresh  32.0      Hyd
2  Sathish  33.0   Mumbai
3   Mahesh   NaN  chennai

In [17]:
dict1={'Names':['Ramesh','Suresh',np.nan,'Mahesh'],
      'Age':[31,32,33,np.nan],
      'City':[np.nan,'Hyd','Mumbai','chennai']}
data3

    Names   Age     City
0  Ramesh    31     Null
1  Suresh    32      Hyd
2    Null    33   Mumbai
3  Mahesh  Null  chennai

method_3

In [18]:
data1.fillna(method='backfill')
# names index 2 is missed values
#  it will replace by index 3 values
# age index 3 is missed value
# we dont have index 4, so the values is NAN

     Names   Age     City
0   Ramesh  31.0      Hyd
1   Suresh  32.0      Hyd
2  Sathish  33.0   Mumbai
3   Mahesh   NaN  chennai

In [19]:
data1

     Names   Age     City
0   Ramesh  31.0      NaN
1   Suresh  32.0      Hyd
2  Sathish  33.0   Mumbai
3   Mahesh   NaN  chennai

>bfill and backfill both are same

>pad and fill both

Method_4

In [20]:
data1

     Names   Age     City
0   Ramesh  31.0      NaN
1   Suresh  32.0      Hyd
2  Sathish  33.0   Mumbai
3   Mahesh   NaN  chennai

In [21]:
age_mean=data1['Age'].mean()
age_mean

32.0

In [22]:
data1['Age'].fillna(age_mean)

0    31.0
1    32.0
2    33.0
3    32.0
Name: Age, dtype: float64

In [23]:
age_median=data1['Age'].median()
age_median
data1['Age'].fillna(age_median)

0    31.0
1    32.0
2    33.0
3    32.0
Name: Age, dtype: float64

**Method_5 - KNN Imputer**

KNN: K nearest neighbours
    
- in the KNN imputer instead of taking mean of taking mean of all the values

- will choose neighbours data

- will take those mean only

KNN Imputer

n_neighbours is parameter can choose by user

In [26]:
from sklearn.imputer import KNNImputer
knn=KNNImputer(n_neighbours=2)
knn.fit_transform(data1[['Age']])

ModuleNotFoundError: No module named 'sklearn.imputer'

**Method - 6**

In [ ]:
- based on other columns

- Some times all above methods will provide good justification

- at that time we need to check other